In [2]:
import numpy as np
import pandas as pd

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100).astype(np.int8))
s2 = pd.Series(np.random.randint(1, high=4, size=100).astype(np.int8))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100).astype(np.int32))

In [4]:
print(s1, s2, s3)

0     3
1     2
2     1
3     1
4     2
     ..
95    2
96    1
97    2
98    1
99    3
Length: 100, dtype: int8 0     3
1     1
2     1
3     1
4     1
     ..
95    1
96    3
97    1
98    1
99    1
Length: 100, dtype: int8 0     14415
1     20112
2     20720
3     17806
4     20586
      ...
95    22106
96    11652
97    18267
98    23849
99    15381
Length: 100, dtype: int32

In [5]:
housemkt=pd.concat([s1,s2,s3],axis=1)
housemkt.head()

   0  1      2
0  3  3  14415
1  2  1  20112
2  1  1  20720
3  1  1  17806
4  2  1  20586

In [7]:
#join concat the values
bigcolumn =pd.concat([s1,s2,s3],axis=0)
#it is still a series,so we need to transform it to a DataFrame
bigcolumn=bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       2
2       1
3       1
4       2
..    ...
95  22106
96  11652
97  18267
98  23849
99  15381

[300 rows x 1 columns]

In [8]:
len(bigcolumn)

300

In [9]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        3
1        2
2        1
3        1
4        2
..     ...
295  22106
296  11652
297  18267
298  23849
299  15381

[300 rows x 1 columns]